app/Controllers/Admin.php

    public function index(): string
    {
        $siswamodel = new SiswaModel();
        $data['siswa'] = $siswamodel->findAll();
---
SELECT *
FROM `siswa`

    private function importCsv($filePath)
    {
        $file = fopen($filePath, 'r');
        $siswaModel = new SiswaModel();
        if ($siswaModel) {

            if (fgetcsv($file)) {
                while (($row = fgetcsv($file, 1000, ',')) !== FALSE) {
                    $data = [
                        'nama' => $row[0],
                        'umur' => (int) $row[1], // Pastikan umur berupa integer
                        'kelas' => $row[2],
                    ];
                    $siswaModel->insert($data);
---
INSERT INTO `siswa` (`nama`, `umur`, `kelas`) VALUES ('Andi', 13, '7')