app/Controllers/UjiKom.php

SELECT *
FROM `siswa`
SELECT *
FROM `eskul`
---
    public function crud(): string
    {
        $siswamodel = new SiswaModel();
        $eskulmodel = new EskulModel();
        $data['siswa'] = $siswamodel->findAll();
        $data['eskul'] = $eskulmodel->findAll();

SELECT *
FROM `siswa`
WHERE `siswa`.`id` = '168'
---
    public function edit($id)
    {

        $siswamodel = new SiswaModel();
        $eskulmodel = new EskulModel();
        $data['siswa'] = $siswamodel->find($id);

INSERT INTO `siswa` (`nama`, `umur`, `kelas`) VALUES ('asd', '213', '2')
INSERT INTO `eskul` (`eskul`) VALUES ('wqe')
---
    public function tambah_pro()
    {
        // Mengambil data dari request
        $data = [
            'nama' => $this->request->getPost('name'),
            'umur' => $this->request->getPost('umur'),
            'kelas' => $this->request->getPost('kelas'),

        ];

        // Validasi input
        if ($this->validate(['name' => 'required|min_length[3]'])) {
            $model = new SiswaModel();
            $eskul = new EskulModel();

            // Simpan data
            if ($model->insert($data)) {
                $datas = [
                    // 'id_siswa' => '58',
                    'eskul' => $this->request->getPost('eskul'),

                ];
                if ($eskul->insert($datas)) {